back_end/app/controllers/authentications_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "email", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def register
    user = User.new(user_params)
    if user.save