back_end/app/controllers/contents_controller.rb

  def index
    @contents = Content.all
---
SELECT "contents".* FROM "contents"

  def create
    @content = Content.new(content_params)

    if @content.save
---
INSERT INTO "contents" ("post_id", "user_id", "body", "language", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["post_id", 1], ["user_id", 9], ["body", "kkkk"], ["language", "kkkk"], ["created_at", 2017-04-19 18:44:26 UTC], ["updated_at", 2017-04-19 18:44:26 UTC], ["title", "kkkk"]]

    def set_content
      @content = Content.find(params[:id])
---
SELECT  "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]