back_end/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    @post.user = current_user
  #///////////////////////////////////////////
    @content = Content.new(content_params)
    @content.post = @post
    @content.user = current_user

    unless @content.save
---
INSERT INTO "contents" ("post_id", "user_id", "body", "language", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["post_id", 6], ["user_id", 7], ["body", "Se deserva mas que la muerte."], ["language", "spanish"], ["created_at", 2017-04-18 15:59:14 UTC], ["updated_at", 2017-04-18 15:59:14 UTC]]
INSERT INTO "posts" ("user_id", "title", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["title", "test tuesday 1122"], ["image", "sadf"], ["created_at", 2017-04-18 10:22:53 UTC], ["updated_at", 2017-04-18 10:22:53 UTC]]