app/controllers/oauth_controller.rb

SELECT  "users".* FROM "users" WHERE (email = 'valerio.risuleo@gmail.com' OR github_id = 23198859) ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 9]]
INSERT INTO "users" ("username", "created_at", "updated_at", "email", "github_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "valeriorisuleo"], ["created_at", 2017-04-19 10:27:37 UTC], ["updated_at", 2017-04-19 10:27:37 UTC], ["email", "[\"valerio.risuleo@gmail.com\"]"], ["github_id", 23198859]]
---
  def github
    token = HTTParty.post('https://github.com/login/oauth/access_token', {
      query: {
        client_id: ENV["GITHUB_CLIENT_ID"],
        client_secret: ENV["GITHUB_CLIENT_SECRET"],
        code: params[:code]
      },
      headers: { 'Accept' => 'application/json'}
    }).parsed_response

# We need to make a second HTTParty request in order to get back the user's profile.

    profile = HTTParty.get('https://api.github.com/user', {
      query: token,
      headers: { 'User-Agent' => 'HTTParty', 'Accept' => 'application/json' }
    }).parsed_response

    p profile
     user = User.where("email = :email OR github_id = :github_id", email: profile["email"], github_id: profile["id"]).first

# If we don't find a user, we want to create a new user, so underneath this line, we want to add the following.

     user = User.new username: profile["login"], email: [profile["email"]] unless user
     user[:github_id] = profile["id"]
    p user

# errors handlers

    if user.save